{"title":"start","uid":"d7401bb47fd5e372095c1f3a58f4990d","slug":"start","date":"2023-04-12T01:01:49.000Z","updated":"2023-04-12T09:20:48.270Z","comments":true,"path":"api/articles/start.json","keywords":null,"cover":null,"content":"<p>As you can see, I started a blog. I’ve long considered starting to write something, but I never knew what to write about. It often feels like every problem in technology has been adequately explained on other people’s blogs, and better than I can explain it. However, sometimes this is not always the case. Often, I have to do multiple searches to find out what the problem is. Sometimes, after spending hours searching, I cobble together a solution that doesn’t appear on anyone’s blog, describes a problem, or solves a problem. I realized that I could write about exactly those things.</p>\n<p>Of course, anyone with a brain can solve a problem on their own, but by keeping a blog, I might save some time for people in the future. I also found that writing helped me keep track of the problems I had solved and helped others better understand what I was spending my time doing. I always struggle with interview questions like “Tell me about some of the challenges you’ve had on this project” or “What was the most difficult mistake you’ve dealt with” because I unfortunately tend to forget what I’ve done. Start doing the next thing. Yes!</p>\n<p>This blog serves as a record of some of the things I’ve done, and I just need to read what I’ve written to refresh my mind. Perhaps my biggest objection to blogging is that I don’t think I have enough time to write about it. As it happens, that’s still an objection. I plan to write every chance I get, but this blog is as much an experiment as anything else. I tried to build my blog with Jekyll and Octopress 3, but it was really more difficult to get started than Hexo, although I may try others later.</p>\n<p>I used Hexo’s Next theme (elegant) and it’s actually not worse than Jekyll at all. So, now I have a blog.</p>\n<p>正如你所看到的，我开了一个博客。我早就考虑开始写点东西，但我从来不知道该写什么。常常感觉科技中的每一个问题都已经在其他人的博客上得到了充分的解释，而且比我解释地的还要好。然而，有时候的情况并非总是如此。很多时候，我必须做多次搜索才能找出问题所在。有时，在花几个小时搜索之后，我拼凑出一个没有在任何人的博客上出现过的， 描述一个问题，或解决一个问题的方案。我意识到，我可以写的正是这些东西。</p>\n<p>当然，任何有头脑的人都可以自己解决问题，但通过保留博客，我可能会为未来的人们节省一些时间。我还发现写作可以帮助我跟踪我已经解决的问题，并帮助其他人更好地了解我花时间做的事情。我总是纠结于“告诉我你在这个项目中遇到的一些挑战”或“你处理过的最困难的错误是什么”这样的面试问题，因为我很不幸地倾向于忘记我做过的事情。开始做接下来的事情。是的！</p>\n<p>这个博客可以作为我做过的一些事情的记录，我只需要阅读我写的东西来刷新我的想法。也许我对写博客最大的反对是我觉得我没有足够的时间来写它。碰巧，这仍然是一个反对意见。我计划一有机会就写，但这个博客和其他任何东西一样都是一个实验。我尝过试过用 Jekyll 和 Octopress 3来搭建我的博客，但是它确实是比Hexo更加难以上手，虽然我以后可能会尝试其它。</p>\n<p>我使用 了 Hexo 的 Next 主题（优雅），它实际上一点也不比Jekyll差。所以，现在我有一个博客了。</p>\n","feature":true,"text":"As you can see, I started a blog. I’ve long considered starting to write something, but I never knew what to write about. It often feels lik...","link":"","photos":[],"count_time":{"symbolsCount":"2.3k","symbolsTime":"2 mins."},"categories":[],"tags":[],"toc":"","author":{"name":"Aurora","slug":"blog-author","avatar":"https://img-blog.csdnimg.cn/20210313122054101.png","link":"/","description":"","socials":{"github":"","twitter":"","stackoverflow":"","wechat":"","qq":"","weibo":"","zhihu":"","csdn":"","juejin":"","customs":{}}},"mapped":true,"prev_post":{"title":"Hello World","uid":"b9663f58f18133b35bfe243f3e916a80","slug":"hello-world","date":"2023-04-12T07:39:06.964Z","updated":"2023-04-12T07:39:06.964Z","comments":true,"path":"api/articles/hello-world.json","keywords":null,"cover":null,"text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the ...","link":"","photos":[],"count_time":{"symbolsCount":430,"symbolsTime":"1 mins."},"categories":[],"tags":[],"author":{"name":"Aurora","slug":"blog-author","avatar":"https://img-blog.csdnimg.cn/20210313122054101.png","link":"/","description":"","socials":{"github":"","twitter":"","stackoverflow":"","wechat":"","qq":"","weibo":"","zhihu":"","csdn":"","juejin":"","customs":{}}},"feature":true},"next_post":{}}